// Найдите дробный результат деления 40 на 13, 65 на 17, 98 на 11. Выведите результаты.
public class Double2{
	public static void main (String[] args) {
		System.out.println(40d/13);
	System.out.println(65d/17);
	System.out.println(98d/11);
	}
}