/* Напишите метод sayNumberMultipliedByTen,
 который принимает аргумент типа double и выводит на экран его значение,
 умноженное в десять раз. */

public static void Metod1() {
    System.out.print("36.6 * 10 = ");
    sayNumberMultipliedByTen(36.6);
}


public static void sayNumberMultipliedByTen(double n) {
    System.out.println(n*10);
}