/* Объявите переменные netBytes и overheadBytes со значениями 5 и 2 соответственно. 
Напишите код, который будет вычислять сумму netBytes и overheadBytes и умножать её на 8. Выведите результат на экран. */

public class MyFirstApp5 {
	public static void main (String[] args) 

{ 
	int netBytes = 5; 
	int overheadBytes = 2;
	System.out.print((netBytes + overheadBytes) * 8);
	

}
}